province = ["กระบี่","กาญจนบุรี","กาฬสินธุ์","กำเเพงเพชร","ขอนเเก่น","จันทรบุรี","ฉะเชิงเทรา","ชลบุรี","ชัยนาท","ชัยภูมิ","ชุมพร","เชียงราย","เชียงใหม่","ตรัง","ตราด","ตาก","นครนายก","นครปฐม"
,"นครพนม","นครราชสีมา","นครสีธรรมราช","นครสวรรค์","นนทบุรี","นราธิวาส","น่าน","บุรีรัมย์","ปทุมธานี","ประจวบ","ปราจีน","ปัตตานี","พะเยา","พังงา","พัทลุง"
,"พิจิตร","พิษณุโลก","เพชรบุรี","เพชรบูรณ์","เเพร่","ภูเก็ต","มหาสารคาม","มุกดาหาร","เเม่ฮ่องสอน","ยโสธร","ยะลา","ร้อยเอ็ด 	","ระนอง"
,"ระยอง","ราชบุรี","ลพบุรี","ลำปาง","ลำพูน ","เลย ","ศรีสะเกษ","สกลนคร","สงขลา","สตูล","สมุทรปราการ","สมุทรสงคราม","สมุทรสาคร","สระเก้ว"
,"สระบุรี","สิงห์บุรี","สุโขทัย","สุพรรณ","สุราฎ","สุรินทร์","หนองคาย","หนองบังลำภู"
,"อยุธยา","อ่างทอง","อำนาจเจริญ","อุดร","อุตรดิตถ์","อุทัย","อุบล "]
km = [814,128,519,358,449,245,82,81,194,342,463,785,696,828,315,426,107,56,740,259,780,240,20,1149,668,383,46,281,136,1055,691,788,840,344,377,123,346,551,862,475,642,924,531,
1084,512,568,179,100,153,599,670,520,531,647,950,973,29,72,36,237,107,142,427,100,644,426,615,577,76,105,585,564,491,219,592]

zero = 0
minS = 0
line = [""]
newkm = 0


for j in range(75):
    for x in range(75):
        newkm=km[x]
        if x == zero:
            line.append(province[x])
            print(province[x])
            newkm=newkm+km[x]
            km[x]=9999
            x=x+1
        elif minS > newkm:
                line.append(province[x])
                print(province[x])
                newkm=newkm+km[x]
                km[x]=9999
                x=x+1


"""print(newkm)"""